; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	instrument2 - instrument
	satellite1 - satellite
	instrument3 - instrument
	instrument4 - instrument
	instrument5 - instrument
	satellite2 - satellite
	instrument6 - instrument
	instrument7 - instrument
	instrument8 - instrument
	satellite3 - satellite
	instrument9 - instrument
	instrument10 - instrument
	instrument11 - instrument
	satellite4 - satellite
	instrument12 - instrument
	instrument13 - instrument
	instrument14 - instrument
	satellite5 - satellite
	instrument15 - instrument
	instrument16 - instrument
	instrument17 - instrument
	satellite6 - satellite
	instrument18 - instrument
	infrared1 - mode
	spectrograph0 - mode
	Star3 - direction
	Star4 - direction
	GroundStation2 - direction
	GroundStation5 - direction
	GroundStation0 - direction
	GroundStation1 - direction
	Star6 - direction
	Planet7 - direction
	Planet8 - direction
	Star9 - direction
	Phenomenon10 - direction
	Planet11 - direction
	Star12 - direction
	Star13 - direction
)
(:init
	(supports instrument0 infrared1)
	(supports instrument0 spectrograph0)
	(calibration_target instrument0 Star6)
	(supports instrument1 infrared1)
	(supports instrument1 spectrograph0)
	(calibration_target instrument1 GroundStation1)
	(calibration_target instrument1 Star6)
	(supports instrument2 infrared1)
	(supports instrument2 spectrograph0)
	(calibration_target instrument2 Star6)
	(calibration_target instrument2 GroundStation2)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(on_board instrument2 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Planet8)
	(supports instrument3 infrared1)
	(supports instrument3 spectrograph0)
	(calibration_target instrument3 Star6)
	(calibration_target instrument3 Star3)
	(supports instrument4 spectrograph0)
	(calibration_target instrument4 GroundStation2)
	(supports instrument5 infrared1)
	(calibration_target instrument5 Star6)
	(on_board instrument3 satellite1)
	(on_board instrument4 satellite1)
	(on_board instrument5 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Star12)
	(supports instrument6 infrared1)
	(supports instrument6 spectrograph0)
	(calibration_target instrument6 Star6)
	(calibration_target instrument6 GroundStation5)
	(supports instrument7 infrared1)
	(supports instrument7 spectrograph0)
	(calibration_target instrument7 GroundStation1)
	(calibration_target instrument7 GroundStation2)
	(supports instrument8 infrared1)
	(supports instrument8 spectrograph0)
	(calibration_target instrument8 GroundStation0)
	(calibration_target instrument8 Star3)
	(on_board instrument6 satellite2)
	(on_board instrument7 satellite2)
	(on_board instrument8 satellite2)
	(power_avail satellite2)
	(pointing satellite2 GroundStation2)
	(supports instrument9 spectrograph0)
	(supports instrument9 infrared1)
	(calibration_target instrument9 Star6)
	(calibration_target instrument9 Star4)
	(supports instrument10 infrared1)
	(supports instrument10 spectrograph0)
	(calibration_target instrument10 Star4)
	(calibration_target instrument10 GroundStation2)
	(supports instrument11 spectrograph0)
	(supports instrument11 infrared1)
	(calibration_target instrument11 GroundStation0)
	(on_board instrument9 satellite3)
	(on_board instrument10 satellite3)
	(on_board instrument11 satellite3)
	(power_avail satellite3)
	(pointing satellite3 Star4)
	(supports instrument12 spectrograph0)
	(calibration_target instrument12 GroundStation2)
	(calibration_target instrument12 GroundStation1)
	(supports instrument13 infrared1)
	(calibration_target instrument13 GroundStation2)
	(supports instrument14 infrared1)
	(supports instrument14 spectrograph0)
	(calibration_target instrument14 GroundStation5)
	(on_board instrument12 satellite4)
	(on_board instrument13 satellite4)
	(on_board instrument14 satellite4)
	(power_avail satellite4)
	(pointing satellite4 Star13)
	(supports instrument15 infrared1)
	(supports instrument15 spectrograph0)
	(calibration_target instrument15 GroundStation1)
	(supports instrument16 spectrograph0)
	(supports instrument16 infrared1)
	(calibration_target instrument16 GroundStation0)
	(supports instrument17 spectrograph0)
	(supports instrument17 infrared1)
	(calibration_target instrument17 GroundStation1)
	(on_board instrument15 satellite5)
	(on_board instrument16 satellite5)
	(on_board instrument17 satellite5)
	(power_avail satellite5)
	(pointing satellite5 Phenomenon10)
	(supports instrument18 infrared1)
	(supports instrument18 spectrograph0)
	(calibration_target instrument18 Star6)
	(calibration_target instrument18 GroundStation1)
	(on_board instrument18 satellite6)
	(power_avail satellite6)
	(pointing satellite6 Star6)
)
(:goal (and
	(pointing satellite1 Star12)
	(pointing satellite3 Star12)
	(pointing satellite6 Star9)
	(have_image Planet7 infrared1)
	(have_image Planet8 infrared1)
	(have_image Star9 infrared1)
	(have_image Phenomenon10 spectrograph0)
	(have_image Planet11 infrared1)
	(have_image Star12 spectrograph0)
	(have_image Star13 infrared1)
))

)

; plan
1. (turn_to satellite6 star9 star6)
   deleted: (pointing satellite6 star6)
   added: (pointing satellite6 star9)
   goals met: 2 of 10
2. (switch_on instrument10 satellite3)
   deleted: (power_avail satellite3)
   added: (power_on instrument10)
   goals met: 2 of 10
3. (calibrate satellite3 instrument10 star4)
   added: (calibrated instrument10)
   goals met: 2 of 10
4. (turn_to satellite3 planet8 star4)
   deleted: (pointing satellite3 star4)
   added: (pointing satellite3 planet8)
   goals met: 2 of 10
5. (take_image satellite3 planet8 instrument10 infrared1)
   added: (have_image planet8 infrared1)
   goals met: 3 of 10
6. (turn_to satellite3 planet7 planet8)
   deleted: (pointing satellite3 planet8)
   added: (pointing satellite3 planet7)
   goals met: 3 of 10
7. (take_image satellite3 planet7 instrument10 infrared1)
   added: (have_image planet7 infrared1)
   goals met: 4 of 10
8. (turn_to satellite3 planet11 planet7)
   deleted: (pointing satellite3 planet7)
   added: (pointing satellite3 planet11)
   goals met: 4 of 10
9. (take_image satellite3 planet11 instrument10 infrared1)
   added: (have_image planet11 infrared1)
   goals met: 5 of 10
10. (turn_to satellite3 phenomenon10 planet11)
   deleted: (pointing satellite3 planet11)
   added: (pointing satellite3 phenomenon10)
   goals met: 5 of 10
11. (take_image satellite3 phenomenon10 instrument10 spectrograph0)
   added: (have_image phenomenon10 spectrograph0)
   goals met: 6 of 10
12. (turn_to satellite3 star13 phenomenon10)
   deleted: (pointing satellite3 phenomenon10)
   added: (pointing satellite3 star13)
   goals met: 6 of 10
13. (take_image satellite3 star13 instrument10 infrared1)
   added: (have_image star13 infrared1)
   goals met: 7 of 10
14. (turn_to satellite3 star9 star13)
   deleted: (pointing satellite3 star13)
   added: (pointing satellite3 star9)
   goals met: 7 of 10
15. (take_image satellite3 star9 instrument10 infrared1)
   added: (have_image star9 infrared1)
   goals met: 8 of 10
16. (turn_to satellite3 star12 star9)
   deleted: (pointing satellite3 star9)
   added: (pointing satellite3 star12)
   goals met: 9 of 10
17. (take_image satellite3 star12 instrument10 spectrograph0)
   added: (have_image star12 spectrograph0)
   goals met: 10 of 10
